In [1]:
import numpy as np
import pandas as pd

In [ ]:
## 1 Read the housingdata.csv file into pandas DataFrame and display first six rows of the
DataFrame

In [126]:
df=pd.read_csv('D:\Downloads\housingdata.csv')

In [127]:
df

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
2  100003000.0           AP    2541654          NaN        1   850
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
5  100006000.0           TN   65465466          NaN        1   800
6  100007000.0        ASSAM    3222321            2   HURLEY   950
7  100008000.0           HP      23131            1        1   NaN
8  100009000.0           HP      21212           na        2  1800

In [7]:
df_first_6=df.head(6)
print(df_first_6)

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
2  100003000.0           AP    2541654          NaN        1   850
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
5  100006000.0           TN   65465466          NaN        1   800

In [ ]:
## 2 Display the column names and row index in separate cells.

In [9]:
df.index

RangeIndex(start=0, stop=9, step=1)

In [10]:
for row in df.index:
    print(row,end=' ')

0 1 2 3 4 5 6 7 8

In [11]:
df.columns

Index(['PID', 'STATE', 'PRICE', 'NUM_BEDROOMS', 'NUM_BATH', 'SQ_FT'], dtype='object')

In [12]:
for colum in df.columns:
    print(colum)

PID
STATE
PRICE
NUM_BEDROOMS
NUM_BATH
SQ_FT

In [ ]:
## 3 a) How many numbers of “STATE” exist in the dataset. Hint: use shape
##   b) How many unique states exist in the dataset

In [17]:
df['STATE'].shape[0]

9

In [20]:
df.shape[0]

9

In [25]:
n=pd.unique(df['STATE'])

In [26]:
n

array(['MP', 'MAHARASHTRA', 'AP', 'TN', 'ASSAM', 'HP'], dtype=object)

In [28]:
p=len(n)
print(p)

6

In [30]:
##4.Retrieve the list of all NaN/Null/Empty cells in the form of Boolean list

In [32]:
print(df.isnull())

     PID  STATE  PRICE  NUM_BEDROOMS  NUM_BATH  SQ_FT
0  False  False  False         False     False  False
1  False  False  False         False     False  False
2  False  False  False          True     False  False
3  False  False  False         False      True  False
4   True  False  False         False     False  False
5  False  False  False          True     False  False
6  False  False  False         False     False  False
7  False  False  False         False     False   True
8  False  False  False         False     False  False

In [33]:
##5 Drop all rows with N/A,NA,na values in Num_Bedrooms

In [36]:
# axis=1 is used to drop the column with NaN values
# axis=0 is used to drop the row with Nan values

In [128]:
df['NUM_BEDROOMS'] = df['NUM_BEDROOMS'].replace('na', np.nan)
UPDATED_DF=df.dropna(subset=['NUM_BEDROOMS'],how='all')

print(UPDATED_DF)

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
6  100007000.0        ASSAM    3222321            2   HURLEY   950
7  100008000.0           HP      23131            1        1   NaN

In [58]:
##6Replace the NaN and String entries in Num_Bath with previous entry

In [41]:
df=df.replace("HURLEY",np.nan)##to replce the string 'hurley' with Nan values
df

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
2  100003000.0           AP    2541654          NaN        1   850
3  100004000.0           TN     321321            1        1   700
4          NaN           TN  589465645            3        2  1600
5  100006000.0           TN   65465466          NaN        1   800
6  100007000.0        ASSAM    3222321            2        1   950
7  100008000.0           HP      23131            1        1   NaN
8  100009000.0           HP      21212           na        2  1800

In [39]:
df['NUM_BATH']=df['NUM_BATH'].fillna(method='ffill')
df

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
2  100003000.0           AP    2541654          NaN        1   850
3  100004000.0           TN     321321            1        1   700
4          NaN           TN  589465645            3        2  1600
5  100006000.0           TN   65465466          NaN        1   800
6  100007000.0        ASSAM    3222321            2        1   950
7  100008000.0           HP      23131            1        1   NaN
8  100009000.0           HP      21212           na        2  1800

In [59]:
##7 Replace the empty values in “SQ_FT” with the mean of the all entries.

In [74]:
df['SQ_FT']=df['SQ_FT'].replace('--',np.nan)
df['SQ_FT']=pd.to_numeric(df['SQ_FT'])
df

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0           MP     321654            3        1  1000.0
1  100002000.0  MAHARASHTRA      21325            3      1.5     NaN
2  100003000.0           AP    2541654          NaN        1   850.0
3  100004000.0           TN     321321            1      NaN   700.0
4          NaN           TN  589465645            3        2  1600.0
5  100006000.0           TN   65465466          NaN        1   800.0
6  100007000.0        ASSAM    3222321            2   HURLEY   950.0
7  100008000.0           HP      23131            1        1     NaN
8  100009000.0           HP      21212           na        2  1800.0

In [75]:
x=df['SQ_FT'].mean()
df['SQ_FT'].fillna(value=x,inplace=True)
df

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0           MP     321654            3        1  1000.0
1  100002000.0  MAHARASHTRA      21325            3      1.5  1100.0
2  100003000.0           AP    2541654          NaN        1   850.0
3  100004000.0           TN     321321            1      NaN   700.0
4          NaN           TN  589465645            3        2  1600.0
5  100006000.0           TN   65465466          NaN        1   800.0
6  100007000.0        ASSAM    3222321            2   HURLEY   950.0
7  100008000.0           HP      23131            1        1  1100.0
8  100009000.0           HP      21212           na        2  1800.0

In [77]:
print("mean is",x)

mean is 1100.0

In [60]:
##8 What is the sum of SQ_FT of all entries in the dataset.

In [82]:
df['SQ_FT']=df['SQ_FT'].replace('--',np.nan)
df['SQ_FT']=pd.to_numeric(df['SQ_FT'])
df

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0           MP     321654            3        1  1000.0
1  100002000.0  MAHARASHTRA      21325            3      1.5     NaN
2  100003000.0           AP    2541654          NaN        1   850.0
3  100004000.0           TN     321321            1      NaN   700.0
4          NaN           TN  589465645            3        2  1600.0
5  100006000.0           TN   65465466          NaN        1   800.0
6  100007000.0        ASSAM    3222321            2   HURLEY   950.0
7  100008000.0           HP      23131            1        1     NaN
8  100009000.0           HP      21212           na        2  1800.0

In [85]:
x=df['SQ_FT'].sum()
print("sum is ",x)

sum is  7700.0

In [61]:
#9 Add a new column “NUM_STORE” and with all the values as 1 for all rows

In [122]:
df=pd.read_csv('D:\Downloads\housingdata.csv')
df

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
2  100003000.0           AP    2541654          NaN        1   850
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
5  100006000.0           TN   65465466          NaN        1   800
6  100007000.0        ASSAM    3222321            2   HURLEY   950
7  100008000.0           HP      23131            1        1   NaN
8  100009000.0           HP      21212           na        2  1800

In [94]:
df['NUM_STORE'] =[1 for i in range(len(df))]
df

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT  NUM_STORE
0  100001000.0           MP     321654            3        1  1000          1
1  100002000.0  MAHARASHTRA      21325            3      1.5    --          1
2  100003000.0           AP    2541654          NaN        1   850          1
3  100004000.0           TN     321321            1      NaN   700          1
4          NaN           TN  589465645            3        2  1600          1
5  100006000.0           TN   65465466          NaN        1   800          1
6  100007000.0        ASSAM    3222321            2   HURLEY   950          1
7  100008000.0           HP      23131            1        1   NaN          1
8  100009000.0           HP      21212           na        2  1800          1

In [62]:
#10 Create a DataFrame containing all entries of TN state only

In [119]:
df1=df[df['STATE']=='TN']
df1

           PID STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
3  100004000.0    TN     321321            1      NaN   700
4          NaN    TN  589465645            3        2  1600
5  100006000.0    TN   65465466          NaN        1   800

In [63]:
#11 Create a DataFrame having SQ_FT area greater than 1000 and display the DataFrame

In [121]:
df['SQ_FT']=df['SQ_FT'].replace('--',np.nan)
df['SQ_FT']=pd.to_numeric(df['SQ_FT'])
df
df2 = df[df['SQ_FT']>1000] 
print(df2)

           PID STATE      PRICE NUM_BEDROOMS NUM_BATH   SQ_FT
4          NaN    TN  589465645            3        2  1600.0
8  100009000.0    HP      21212           na        2  1800.0

In [64]:
#12 Create a DataFrame having only first Three columns and First Three rows

In [112]:
df3=df.iloc[0:3,0:3]
df3

           PID        STATE    PRICE
0  100001000.0           MP   321654
1  100002000.0  MAHARASHTRA    21325
2  100003000.0           AP  2541654

In [65]:
#13 Display the state having highest average price per square foot of housing area. Hint: Average of
##(TotalPrice/Sq_Ft)

In [124]:
df['SQ_FT']=df['SQ_FT'].replace('--',np.nan)
df['SQ_FT']=pd.to_numeric(df['SQ_FT'])
df['PRICE']=pd.to_numeric(df['PRICE'])
avg=list(map(lambda x,y:x/y,df['PRICE'],df['SQ_FT']))

In [125]:
df['STATE'][avg.index(max(avg))]

'TN'